#include "Com_Bq769.h"

int resist_temper_table[181] = {
    324, 333, 342, 351, 361, 371,                                                   // 120 ~ 125℃
    382, 393, 404, 415, 427, 439, 451, 464, 478, 491,                               // 110 ~ 119℃
    505, 520, 535, 551, 567, 584, 601, 619, 637, 657,                               // 100 ~ 109℃
    676, 697, 718, 740, 763, 787, 811, 837, 863, 890,                               // 90 ~ 99℃
    919, 948, 979, 1011, 1044, 1078, 1113, 1150, 1189, 1228,                        // 80 ~ 89℃
    1270, 1313, 1358, 1404, 1452, 1503, 1555, 1610, 1666, 1725,                     // 70 ~ 79℃
    1786, 1850, 1917, 1986, 2058, 2133, 2211, 2293, 2377, 2466,                     // 60 ~ 69℃
    2558, 2654, 2754, 2859, 2968, 3081, 3200, 3324, 3453, 3588,                     // 50 ~ 59℃
    3728, 3875, 4029, 4189, 4357, 4532, 4716, 4907, 5108, 5318,                     // 40 ~ 49℃
    5537, 5767, 6008, 6259, 6523, 6800, 7090, 7394, 7712, 8047,                     // 30 ~ 39℃
    8397, 8765, 9151, 9557, 10000, 10431, 10901, 11395, 11915, 12461,               // 20 ~ 29℃
    13036, 13641, 14277, 14947, 15652, 16395, 17177, 18000, 18868, 19783,           // 10 ~ 19℃
    20746, 21762, 22833, 23962, 25152, 26408, 27732, 29128, 30601, 32116,           // 1 ~ 9℃
    33795, 35524, 37349, 39274, 41306, 43450, 45712, 48100, 50620, 53280,           // -9 ~ 0℃
    56087, 59052, 62183, 65489, 68982, 72672, 76574, 80699, 85063, 89682,           // -19 ~ -10℃
    94573, 99756, 105252, 111084, 117280, 123866, 130877, 138347, 146315, 154827,   // -29 ~ -20℃
    163931, 173681, 184139, 195372, 207454, 220466, 234498, 249649, 266022, 283730, // -39 ~ -30℃
    302890, 323623, 346049, 370283, 396426, 424553, 454704, 486858, 520911, 556644, // -49 ~ -40℃
    593686, 631466, 669165, 705664, 739500                                          // -55 ~ -50℃
};


int voltage_soc_ocv_table[101] = {
    2500,                                                       // 0% SOC
    2580, 2660, 2730, 2795, 2850, 2900, 2950, 3000, 3060, 3120, // 1%~10% SOC
    3145, 3165, 3180, 3192, 3202, 3210, 3216, 3222, 3231, 3240, // 11%~20% SOC
    3241, 3242, 3243, 3244, 3245, 3246, 3247, 3248, 3249, 3250, // 21%~30% SOC
    3251, 3252, 3253, 3254, 3255, 3256, 3257, 3258, 3259, 3260, // 31%~40% SOC
    3261, 3262, 3263, 3264, 3265, 3266, 3267, 3268, 3269, 3270, // 41%~50% SOC
    3271, 3272, 3273, 3274, 3275, 3276, 3277, 3278, 3279, 3280, // 51%~60% SOC
    3281, 3282, 3283, 3284, 3285, 3286, 3287, 3288, 3289, 3290, // 61%~70% SOC
    3291, 3292, 3293, 3294, 3295, 3296, 3297, 3298, 3299, 3300, // 71%~80% SOC
    3301, 3302, 3303, 3304, 3305, 3306, 3307, 3308, 3309, 3310, // 81%~90% SOC
    3315, 3320, 3325, 3332, 3342, 3358, 3380, 3408, 3430, 3450  // 91%~100% SOC
};

/**
 * @brief 根据数值查询表的坐标
 *
 * 1  设定本次查询的起点   用上次的查询索引 作为本次查询的起点
 * 2  循环查询  范围 >0  <表格总长度
 * 3     循环过程  判断是否命中   命中 大于等于当前坐标对应的值 小于坐标+1的值   返回坐标前 要修改last_index 和 last_value
 * 4                未命中  如果上次值大于本次值  坐标--
 *                          反之   坐标++
 * 5   极值处理 如果值不在表中范围  比最小值小  给最小值  比最大值大 给最大值
 *
 */
uint16_t
getTableIndexByValue(int value, int *table, uint16_t table_size, uint16_t *last_index, int *last_value)
{

    // * 1  设定本次查询的起点   用上次的查询索引 作为本次查询的起点
    int16_t cur_index = *last_index;

    //  * 2  循环查询  范围 >0  <表格总长度
    while (cur_index < table_size && cur_index >= 0)
    {
        //  * 3     循环过程  判断是否命中   命中 大于等于当前坐标对应的值 小于坐标+1的值   返回坐标前 要修改last_index 和 last_value
        if (value >= table[cur_index] && value < table[cur_index + 1])
        {
            *last_index = cur_index;
            *last_value = table[cur_index];
            return cur_index;
        }
        //  * 4                未命中  如果上次值大于本次值  坐标--
        //  *                          反之   坐标++
        else if (*last_value > value)
        {
            cur_index--;
        }
        else if (*last_value < value)
        {
            cur_index++;
        }
    }
    if (cur_index < 0)
    {
        return 0;
    }
    else if (cur_index >= table_size)
    {
        return table_size - 1;
    }

    return cur_index;
}

static uint16_t last_index_tempr = 125 - 25; // 25℃的坐标
static int last_value_tempr = 10000;         // 25℃的电阻

/**
 * @brief 通过查表法把电阻换算为温度
 */
int8_t Com_BQ769_getTemperByResist(uint32_t resist_value)
{

    uint16_t index = getTableIndexByValue((int)resist_value, resist_temper_table, 181, &last_index_tempr, &last_value_tempr);

    return 125 - index; // 温度
}

static uint16_t last_index_soc = 50; // 50%电量
static int last_value_soc = 3261;    // 50%电量的电压

/**
 * @brief 通过查表法把电压换算为电量百分比
 */
uint8_t Com_BQ769_getPercentByVoltage(uint16_t voltage_value)
{
    uint16_t index = getTableIndexByValue((int)voltage_value, voltage_soc_ocv_table, 101, &last_index_soc, &last_value_soc);
    printf("index:%d\n", index);
    return index; // 索引和电量百分比值一致
}
